# TrussNotJoinedWebs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..TrussNotJoinedWebs Property
BuiltInFailures..::..TrussFailures Class See Also
---
The current edits are causing some webs to disjoin. The truss layout family requires additional constraints to maintain these joins.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussNotJoinedWebs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussNotJoinedWebs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussNotJoinedWebs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace